---
layout: post
title: "小谈谈弹幕设计"
date: 2013-06-28 12:37
comments: true
categories: 设计
---
最近很喜欢使用[弹幕网站](http://www.bilibili.tv/)看动画片。我记得我最早是从[王者天下](http://baike.baidu.com/view/1306119.htm#sub9272586)的弹幕视频开始的。[王者天下](http://baike.baidu.com/view/1306119.htm#sub9272586)这个片子一开始10话是在一个一般的[视频网站](http://www.letv.com/)上看的。看得时候感觉总体挺好看的，但是剧情对我来说稍慢。看到第10话的时候，就一直搁那儿了。后来突然有一天想起来的时候，发现这片子第一季已经播完了。于是在[B站](http://www.bilibili.tv/)找到了这篇子的[专辑](http://www.bilibili.tv/sp/%E7%8E%8B%E8%80%85%E5%A4%A9%E4%B8%8B)，开始了弹幕之旅。刚刚开始的时侯有那么一点点抵触情绪。感觉弹幕破坏了原作的气氛。但是后来越来越喜欢，以至于没有弹幕[吐槽](http://baike.baidu.com/view/308283.htm?fr=ala0_1_1)，很多视频都看不下去了。个人觉得[王者天下](http://baike.baidu.com/view/1306119.htm#sub9272586)的弹幕厚度正对本人的口味。相比与一些[新番](http://baike.baidu.com/view/1497143.htm?fromId=409248&redirected=seachword)，有时候半屏半屏的弹幕，反而来不及读有趣的[吐槽](http://baike.baidu.com/view/308283.htm?fr=ala0_1_1)。于是乎，鄙人想了如下设计以增进用户体验。

### 假设
在介绍本人所设想的功能之前，有以下假设条件：

+ 本文所提及的弹幕功能旨在增进类似于鄙人之类的使用者的用户体验。
+ 鄙人把自己定义为弹幕视频网站的轻中度使用者。
+ 鄙人一般使用弹幕视频网站来追新番，或者较有名的旧番。其他类似MAD，MUGEN，实况等等，基本不怎么看。
+ 鄙人喜欢看很好笑的吐槽弹幕，但是不会在海量的弹幕中一遍一遍把视频返回去，把所有弹幕读完。如前文中所提到的，个人感觉王者天下的弹幕厚度刚刚好。
+ 鄙人能理解较大众的吐槽如“姨妈大”，“德玛西亚之力”，“兵库北”等等。但是有些特别深奥的，还不是太理解。

### 功能1：弹幕按排名分色

**所需技术支持**：能点击动态滚动的弹幕。鄙人胡乱猜测这个可能在技术上实现起来还有一定难度。如果动态不行的话，可以考虑在静态也就是暂停的时候，实现点击弹幕。以下是假设能点击弹幕的话。

+ 鼠标左键某条弹幕，则此弹幕评分+1
+ 鼠标右键某条弹幕，则此弹幕评分-1
+ 按评分从高到低，弹幕自动改变成以下颜色：
    + <font color="DarkOrange">**我是橙色弹幕菌**</font>
    + <font color="DarkMagenta">**我是紫色弹幕菌**</font>
    + <font color="MediumBlue">**我是蓝色弹幕菌**</font>
    + <font color="Lime">**我是绿色弹幕菌**</font>
    + <font color="GhostWhite">**我是白色弹幕菌**</font>
    + <font color="DarkGray">**我是灰色弹幕菌**</font>
    + 好吧，有些同学可能看出来了。这跟WOW装备的颜色一样。

弹幕有了颜色之后，更容易辨认受欢迎的搞笑吐槽。另一方面也能减少类似"OOXX+1"，"OOXX加一"，"OOXX笑尿"缺乏营养的弹幕。关于变色与评分的关系，可以参考以下方法，当然仅供参考，具体数据需根据具体情况进行调整。

+ <font color="DarkOrange">**橙色弹幕菌**</font>：评分大于100，或者评分等于观看人数的5%。
+ <font color="DarkMagenta">**紫色弹幕菌**</font>：评分大于50，或者评分等于观看人数的3%。
+ <font color="MediumBlue">**蓝色弹幕菌**</font>：评分大于20，或者评分等于观看人数的1%。
+ <font color="Lime">**绿色弹幕菌**</font>：评分大于10，或者评分等于观看人数的0.7%。
+ <font color="GhostWhite">**白色弹幕菌**</font>：评分大于3，或者评分等于观看人数的0.3%。
+ <font color="DarkGray">**灰色弹幕菌**</font>：评分等于0，弹幕初始为灰色。

### 功能2：弹幕按排名排序

如果有了之前的评分系统的话，<font color="DarkOrange">**橙色弹幕菌**</font>出现在最上行，<font color="DarkMagenta">**紫色弹幕菌**</font>在其次，以此类推。能更进一步使用户简单快捷的看见最好笑的吐槽。在此基础上给于用户“设置最大弹幕显示行数”的设置选项，更能进一步提高看视频的流畅度。当然这功能并不那么重要，较锦上添花的感觉。

### 功能3：高阶弹幕效果

在发送弹幕的地方新增高阶弹幕效果选项，则此弹幕被发送并获得一定评分后，自动触发高阶弹幕效果。鄙人现在能想到的可以有以下几种：

**1** **刷屏类**。此高阶弹幕效果在获得一定评分后，自我复制成更多行数。最终效果类似于“快来搞死那激萌的萝莉”，“帅哥你是谁”等等。感觉有点一言难尽，上个图。

*高阶弹幕效果触发前：*

{% img /images/abc111.jpg 500 300 '事前' %}

*高阶弹幕效果触发后：*

{% img /images/abc123.jpg 500 300 '事后' %}

**2** **注释类**。此高阶弹幕效果在获得一定评分后，能在指定位置化身成为一个有指向性的弹幕。感觉有点一言难尽，上个图。

*高阶弹幕效果触发前：*

{% img /images/xin_ttt2.jpg 500 300 '事前' %}

*高阶弹幕效果触发后：*

{% img /images/ttt5.jpg 500 300 '事后' %}

**3** **野生弹幕菌类**。此高阶弹幕效果在获得一定评分后，则出现在字幕的地方，且无法被其他弹幕覆盖。

### 功能4：成就系统

如用户的弹幕受到+1评分的话，在其帐号内记录相关数据。加入货币，等级，或者称号系统。以奖励广受好评的弹幕发布者。促进更过更好的吐槽。

### 功能5：关注特定人员的弹幕

通过成就系统。对用户进行排名，并公布每周吐槽排行榜等。用户可对一些特定用户进行关注（像微博一样）。如用户A关注了用户B，那么用户A在观看视频时，用户B所发的弹幕会以<font color="Crimson">**红色弹幕菌**</font>身份出现在滚动弹幕第一行。

*申明：本人对现大多数弹幕网站功能并不完全熟悉。本文中所提到的功能，如有雷同纯属巧合！*
